<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Package recipe for Bluejeans app.</string>
    <key>Identifier</key>
    <string>com.github.aniegowski.pkg.bluejeansapp</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BluejeansApp</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>ParentRecipe</key>
    <string>com.github.aniegowski.download.bluejeansapp</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgPacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_pkg</key>
                <string>%RECIPE_CACHE_DIR%/%filename%</string>
                <key>source_flatpkg_dir</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
